Config/Documents/ВедомостьКомпенсацииРодительскойПлатыКВыплате.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ВедомостьКомпенсацииРодительскойПлатыКВыплате</Name>
			<BasedOn>
				<xr:Item>Document.НачислениеКомпенсацииРодительскойПлаты</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УчетКомпенсацииРодительскойПлаты</xr:Item>
				<xr:Item>AccountingRegister.ЖурналПроводокЕПСБУ</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДетскоеУчреждение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаДетскогоУчреждения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыДетскогоУчреждения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетЗаНесколькоМесяцев</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГлБухгалтер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.НачислениеКомпенсацииРодительскойПлаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьПлатежныйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаКассовыйРасходСокращенная</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаКассовыйРасход</v8:Type>
						<v8:Type>cfg:DocumentRef.КассовоеВыбытие</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаВыгрузки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиВыгрузкиКомпенсацииРодительскойПлаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КассовыйОрган</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерРеестра</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВедомостьКомпенсации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДетскоеУчреждение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГруппаДетскогоУчреждения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ГруппыДетскогоУчреждения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ребенок</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Дети</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Плательщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентКомпенсации</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаКомпенсации</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аннулировано</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетПлательщика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БанковскиеИКазначейскиеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НастройкаКомпенсации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НастройкиРасчетовПоРодительскойПлате</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КПС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КФО</Name>
							<Type>
								<v8:Type>cfg:EnumRef.КВД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/InformationRegisters/ПлательщикиПоУслугамДДУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПлательщикиПоУслугамДДУ</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Плательщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетПлательщика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеИКазначейскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Ребенок</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Дети</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/InformationRegisters/СоставГруппДДУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СоставГруппДДУ</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ГруппаДетскогоУчреждения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыДетскогоУчреждения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Льгота</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛьготыСтудентов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтавкаОплаты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиОплатыОбразование</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Актуальность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Ребенок</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Дети</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/Catalogs/БанковскиеИКазначейскиеСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>БанковскиеИКазначейскиеСчета</Name>
			<Comment>Банковские и казначейские счета контрагентов и органов казначейства (финансовых органов)</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Казначейства</xr:Item>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>БанкДляРасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВсегдаУказыватьКПП</Name>
					<Comment>Всегда указывать КПП в платежных документах</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГосударственныйКонтрактПоГОЗ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГосударственныеОборонныеЗаказы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КассовыйОрган</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
						<v8:Type>cfg:CatalogRef.Казначейства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорреспондентИНН</Name>
					<Comment>ИНН корреспондента по требованиям банка</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорреспондентКПП</Name>
					<Comment>КПП корреспондента по требованиям банка</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорреспондентТекст</Name>
					<Comment>Наименование корреспондента по требованиям банка</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестонахождениеФилиалаБанка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСчетаНеУказывается</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтдельныйСчетГОЗ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетЗакрыт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетКазначейства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеИКазначейскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЛицевогоСчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЛицевыхСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФилиалБанка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Documents/ВедомостьКомпенсацииРодительскойПлатыКВыплате/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Создает элементы справочника ДокументыБИА для выгрузки информации в 1С:Архив.
// 
// Параметры:
//  СсылкаНаОбъектИсточник - ОпределяемыйТип.СсылкаНаОбъектИсточникБИА - ссылка на объект,
//   который нужно передать в 1С:Архив.
//
// Возвращаемое значение:
//  Массив из ДокументОбъект.ДокументыБИА - созданные документы.
//
Функция СоздатьДокументыБИА(СсылкаНаОбъектИсточник) Экспорт
	СформированныеДокументыБИА = Новый Массив;
	
	ОбменСАрхивомБГУ.СоздатьДокументыБИАДляДокументаУчета(СсылкаНаОбъектИсточник, СформированныеДокументыБИА);
	
	Возврат СформированныеДокументыБИА;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
 
	ТаблицыДляДвижений = СтруктураДополнительныеСвойства.ТаблицыДляДвижений;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Ведомость.Ссылка КАК Регистратор,
	|	Ведомость.Организация КАК Организация,
	|	Ведомость.КонецПериода КАК Период,
	|	&ВидДвижения КАК ВидДвижения,
	|	Ведомость.НачалоПериода КАК НачалоПериода,
	|	ВедомостьТЧ.ДетскоеУчреждение КАК ДетскоеУчреждение,
	|	ВедомостьТЧ.Ребенок КАК Ребенок,
	|	ВедомостьТЧ.Плательщик КАК Плательщик,
	|	ВедомостьТЧ.ПроцентКомпенсации КАК ПроцентКомпенсации,
	|	ВедомостьТЧ.СуммаКомпенсации КАК СуммаКомпенсации,
	|	ВедомостьТЧ.НастройкаКомпенсации КАК НастройкаКомпенсации,
	|	ВедомостьТЧ.КПС КАК КПС,
	|	ВедомостьТЧ.КФО КАК КФО,
	|	Ведомость.ИФО КАК ИФО
	|ИЗ
	|	Документ.ВедомостьКомпенсацииРодительскойПлатыКВыплате.ВедомостьКомпенсации КАК ВедомостьТЧ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВедомостьКомпенсацииРодительскойПлатыКВыплате КАК Ведомость
	|		ПО ВедомостьТЧ.Ссылка = Ведомость.Ссылка
	|ГДЕ
	|	Ведомость.Ссылка = &Ссылка
	|	И НЕ ВедомостьТЧ.Аннулировано";
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.УстановитьПараметр("ВидДвижения", ВидДвиженияНакопления.Расход);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	ТаблицыДляДвижений.Вставить("УчетКомпенсацииРодительскойПлаты", Результат);

КонецПроцедуры


// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати	= "Документ.ВедомостьКомпенсацииРодительскойПлатыКВыплате";
	КомандаПечати.Идентификатор		= "ПФ_MXL_ВедомостьКомпенсацииРПКВыплате";
	КомандаПечати.Представление		= НСтр("ru = 'Ведомость компенсации родительской платы к выплате'");
	КомандаПечати.Порядок			= 1;
	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_ВедомостьКомпенсацииРПКВыплате") Тогда
		// Формируем табличный документ и добавляем его в коллекцию печатных форм.
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"ПФ_MXL_ВедомостьКомпенсацииРПКВыплате",
			"Ведомость компенсации родительской платы к выплате",
			ПечатьВедомостиКВыплате(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
		
КонецПроцедуры

// Возвращает таблицу ведомости, свернутую по КПС и КФО.
// 
// Параметры:
// 	Ссылка - ДокументСсылка.ВедомостьКомпенсацииРодительскойПлатыКВыплате - документ
// Возвращаемое значение:
// 	ТаблицаЗначений - свернутая таблица. Содержит колонки:
//		* КПС - СправочникСсылка.КлассификационныеПризнакиСчетов - КПС
//		* КФО - ПеречислениеСсылка.КВД - КФО
//		* СуммаКомпенсации - Число - сумма компенсации.
Функция ВедомостьКомпенсацииПоКПС(Ссылка) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВедомостьКомпенсацииРодительскойПлатыКВыплатеВедомостьКомпенсации.КПС,
	|	ВедомостьКомпенсацииРодительскойПлатыКВыплатеВедомостьКомпенсации.КФО,
	|	СУММА(ВедомостьКомпенсацииРодительскойПлатыКВыплатеВедомостьКомпенсации.СуммаКомпенсации) КАК СуммаКомпенсации
	|ИЗ
	|	Документ.ВедомостьКомпенсацииРодительскойПлатыКВыплате.ВедомостьКомпенсации КАК
	|		ВедомостьКомпенсацииРодительскойПлатыКВыплатеВедомостьКомпенсации
	|ГДЕ
	|	ВедомостьКомпенсацииРодительскойПлатыКВыплатеВедомостьКомпенсации.Ссылка = &Ведомость
	|	И
	|	НЕ ВедомостьКомпенсацииРодительскойПлатыКВыплатеВедомостьКомпенсации.Аннулировано
	|СГРУППИРОВАТЬ ПО
	|	ВедомостьКомпенсацииРодительскойПлатыКВыплатеВедомостьКомпенсации.КПС,
	|	ВедомостьКомпенсацииРодительскойПлатыКВыплатеВедомостьКомпенсации.КФО";
	Запрос.УстановитьПараметр("Ведомость", Ссылка);
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Функция ПолучитьДанныеНачисленияКомпенсации(Документ, КассовыйОрган) Экспорт
	
	Результат = Новый Структура("Шапка, ВедомостьКомпенсации");

	ДанныеЗаполнения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Документ, "Дата, Организация, ИФО, Подразделение,"
		+ "ДетскоеУчреждение, ГруппаДетскогоУчреждения, РасчетЗаНесколькоМесяцев, НачалоПериода, КонецПериода,"
		+ "НаправлениеДеятельности");	
	
	// Реквизиты шапки
	Результат.Шапка = ДанныеЗаполнения;
	
	// Данные табличной части
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	НачислениеКомпенсацииРодительскойПлатыНачисления.Ребенок КАК Ребенок
	|ПОМЕСТИТЬ СоставДокумента
	|ИЗ
	|	Документ.НачислениеКомпенсацииРодительскойПлаты.Начисления КАК НачислениеКомпенсацииРодительскойПлатыНачисления
	|ГДЕ
	|	НачислениеКомпенсацииРодительскойПлатыНачисления.Ссылка = &Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ребенок
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПлательщикиПоУслугамДДУСрезПоследних.Ребенок,
	|	ПлательщикиПоУслугамДДУСрезПоследних.СчетПлательщика
	|ПОМЕСТИТЬ ДанныеПлательщиков
	|ИЗ
	|	РегистрСведений.ПлательщикиПоУслугамДДУ.СрезПоследних(&ДатаСреза, Ребенок В (ВЫБРАТЬ
	|				СоставДокумента.Ребенок
	|			Из
	|				СоставДокумента КАК СоставДокумента)) КАК
	|		ПлательщикиПоУслугамДДУСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаНачислений.ДетскоеУчреждение КАК ДетскоеУчреждение,
	|	ТаблицаНачислений.ГруппаДетскогоУчреждения КАК ГруппаДетскогоУчреждения,
	|	ТаблицаНачислений.Договор КАК Договор,
	|	ТаблицаНачислений.Ребенок КАК Ребенок,
	|	ТаблицаНачислений.Ребенок.Контрагент КАК Контрагент,
	|	ТаблицаНачислений.Плательщик КАК Плательщик,
	|	ЕСТЬNULL(ДанныеПлательщиков.СчетПлательщика, ЗНАЧЕНИЕ(Справочник.БанковскиеИКазначейскиеСчета.ПустаяСсылка)) КАК СчетПлательщика,
	|	ТаблицаНачислений.ПроцентКомпенсации КАК ПроцентКомпенсации,
	|	ТаблицаНачислений.СуммаКомпенсации КАК СуммаКомпенсации,
	|	ТаблицаНачислений.НастройкаКомпенсации КАК НастройкаКомпенсации,
	|	ЕСТЬNULL(ТаблицаНачислений.НастройкаКомпенсации.РасчетКомпенсацииНеЗависитОтБазы, ЛОЖЬ) КАК НеЗависитОтБазы,
	|	ТаблицаНачислений.КПС КАК КПС,
	|	ТаблицаНачислений.КФО КАК КФО
	|ИЗ
	|	Документ.НачислениеКомпенсацииРодительскойПлаты.Начисления КАК ТаблицаНачислений
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеПлательщиков КАК ДанныеПлательщиков
	|		ПО ТаблицаНачислений.Ребенок = ДанныеПлательщиков.Ребенок
	|ГДЕ
	|	ТаблицаНачислений.Ссылка = &Ссылка
	|	И &УсловиеКассовыйОрган
	|УПОРЯДОЧИТЬ ПО
	|	ТаблицаНачислений.НомерСтроки";
	Запрос.УстановитьПараметр("Ссылка",    Документ);
	Запрос.УстановитьПараметр("ДатаСреза", ДанныеЗаполнения.Дата);
	
	Если ЗначениеЗаполнено(КассовыйОрган) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеКассовыйОрган", "ЕстьNULL(ДанныеПлательщиков.СчетПлательщика.КассовыйОрган, ЗНАЧЕНИЕ(Справочник.Банки.ПустаяСсылка)) = &КассовыйОрган");
		Запрос.УстановитьПараметр("КассовыйОрган", КассовыйОрган);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеКассовыйОрган", "ИСТИНА");
	КонецЕсли;
	
	Результат.ВедомостьКомпенсации = Запрос.Выполнить().Выгрузить();
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПечатьВедомостиКВыплате(МассивОбъектов, ОбъектыПечати)
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПФ_MXL_ВедомостьКомпенсацииРПКВыплате";
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ВедомостьКомпенсацииРодительскойПлатыКВыплате.ПФ_MXL_ВедомостьКомпенсацииРПКВыплате");
	
	Для Каждого Ссылка Из МассивОбъектов Цикл
		ДанныеДляПечати = ПодготовитьДанныеДляПечати(Ссылка);
		
		Область = Макет.ПолучитьОбласть("Шапка");
		
		Если НЕ ЗначениеЗаполнено(Ссылка.ГруппаДетскогоУчреждения) Тогда
			Область.УдалитьОбласть(Область.Область("ГруппаШапка"), ТипСмещенияТабличногоДокумента.ПоВертикали);
		КонецЕсли;
		
		Область.Параметры.Заполнить(ДанныеДляПечати.Шапка);
		ТабДок.Вывести(Область);
		
		Область = Макет.ПолучитьОбласть("Строка");
		
		Если ЗначениеЗаполнено(Ссылка.ГруппаДетскогоУчреждения) Тогда
			Область.УдалитьОбласть(Область.Область("ГруппаСтрока"), ТипСмещенияТабличногоДокумента.ПоВертикали);
		КонецЕсли;
		
		Для Каждого Стр Из ДанныеДляПечати.ТаблицаСтрок Цикл
			Область.Параметры.Заполнить(Стр);
			ТабДок.Вывести(Область);
		КонецЦикла;
		
		Область = Макет.ПолучитьОбласть("Итого");
		Область.Параметры.Заполнить(ДанныеДляПечати.Итоги);
		ТабДок.Вывести(Область);
		
		Область = Макет.ПолучитьОбласть("Подписи");
		Область.Параметры.Заполнить(ДанныеДляПечати.Подписи);
		ТабДок.Вывести(Область);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДок, 1, ОбъектыПечати, МассивОбъектов[0]);
	КонецЦикла;
	
	Возврат ТабДок;
	
КонецФункции

Функция ПодготовитьДанныеДляПечати(Ссылка)
	
	ДанныеДляПечати = Новый Структура;
	
	Шапка = Новый Структура;
	Шапка.Вставить("Период", Формат(Ссылка.НачалоПериода, "ДФ='ММММ гггг ""г.""'"));
	Шапка.Вставить("Дата", Ссылка.Дата);
	Шапка.Вставить("Организация", ?(Ссылка.Организация.ИспользоватьВПлатежныхДокументахСокращенноеНаименование, Ссылка.Организация.Наименование, Ссылка.Организация.НаименованиеПолное));
	Шапка.Вставить("КодПоОКПО", Ссылка.Организация.КодОКПО);
	Шапка.Вставить("ГруппаДДУ", ?(ЗначениеЗаполнено(Ссылка.ГруппаДетскогоУчреждения), Ссылка.ГруппаДетскогоУчреждения, ""));
	Шапка.Вставить("ДокументОснование", ?(ЗначениеЗаполнено(Ссылка.ДокументОснование), Ссылка.ДокументОснование, ""));
	Шапка.Вставить("КассовыйОрган", ?(ЗначениеЗаполнено(Ссылка.КассовыйОрган), Ссылка.КассовыйОрган, ""));
	
	ДанныеДляПечати.Вставить("Шапка", Шапка);
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ВедомостьКомпенсацииКВыплате.НомерСтроки КАК Нпп,
	|	ВедомостьКомпенсацииКВыплате.ГруппаДетскогоУчреждения КАК ГруппаДДУ,
	|	ВедомостьКомпенсацииКВыплате.Ребенок КАК Ребенок,
	|	ВедомостьКомпенсацииКВыплате.Плательщик КАК Плательщик,
	|	ВедомостьКомпенсацииКВыплате.СчетПлательщика.Код КАК СчетПлательщика,
	|	ВедомостьКомпенсацииКВыплате.СуммаКомпенсации КАК СуммаКомпенсации,
	|	ВедомостьКомпенсацииКВыплате.ПроцентКомпенсации КАК Процент,
	|	Договоры.Договор КАК Договор
	|ИЗ
	|	Документ.ВедомостьКомпенсацииРодительскойПлатыКВыплате.ВедомостьКомпенсации КАК ВедомостьКомпенсацииКВыплате
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоставГруппДДУ.СрезПоследних(&КонецПериода, ) КАК Договоры
	|		ПО ВедомостьКомпенсацииКВыплате.Ребенок = Договоры.Ребенок
	|ГДЕ
	|	ВедомостьКомпенсацииКВыплате.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Нпп";

	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(Ссылка.НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(Ссылка.КонецПериода));
	Запрос.УстановитьПараметр("Организация", Ссылка.Организация);
	Запрос.УстановитьПараметр("Группа", Ссылка.ГруппаДетскогоУчреждения);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	ТаблицаСтрок = Запрос.Выполнить().Выгрузить();
	
	ДанныеДляПечати.Вставить("ТаблицаСтрок", ТаблицаСтрок);
	
	Итоги = Новый Структура;
	Итоги.Вставить("СуммаКомпенсации", ТаблицаСтрок.Итог("СуммаКомпенсации"));
	
	ДанныеДляПечати.Вставить("Итоги", Итоги);
	
	Подписи = Новый Структура;
	Подписи.Вставить("Дата", Ссылка.Дата);
	Подписи.Вставить("ГлБухгалтер", Корреспонденты.ФИОПоОбъекту(Ссылка.ГлБухгалтер, Истина));
	
	ДанныеДляПечати.Вставить("Подписи", Подписи);
	
	Возврат ДанныеДляПечати;
	
КонецФункции

#КонецОбласти

#КонецЕсли
